// =============================================================
// initialize.js - HTMLが読み込まれた後に初期化する処理を行う
// =============================================================

// 利用モジュール & パッケージ =====================================
import setEvent from '../Controller/setEvent';
import sendKeyword from '../Controller/sendKeyword';
// =============================================================

// グローバル変数 ================================================
// =============================================================

/**
 * SetEvent - イベントリスナーを初期化する関数
 */
export default function initialize() {
  setEvent();
  sendKeyword();
}

// =============================================================
