// =============================================================
// initialize.js - HTMLが読み込まれた後に初期化する処理を行う
// =============================================================

// 利用モジュール & パッケージ =====================================
import setEvent from '../Controller/setEvent';
import * as send from '../Controller/send';
import * as render from '../View/renderResult';
// =============================================================

// グローバル変数 ================================================
// =============================================================

/**
 * initialize - 初回読み込み時に各種要素を初期化・設定する関数
 */
export default function initialize() {
  setEvent();
  send.inputKeyword;
  render.resultMovies;
}

// =============================================================
