// =============================================================
// load.js - HTMLが読み込まれた後に初期化、変数を格納する処理を行う
// =============================================================

// 利用モジュール & パッケージ =====================================
import openNav from '../View/navigation'; // ナビゲーションに関係する処理を行う
// =============================================================

// グローバル変数 ================================================
// ハンバーガーボタン
const navButton = $('#nav-button');
// デバイスに応じてタッチイベントを判定する処理
const TOUCH = ('ontouchstart' in document) ? 'touchstart' : 'click';
// =============================================================

/**
 * SetEvent - イベントリスナーを初期化する関数
 */
export const setEvent = () => {
  navButton.on(TOUCH, function(e) {
    openNav();
  });
};

// =============================================================
